---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures
source: html/d4679f32-45d9-bec2-e0ff-168c3aee6de9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures

Failures about GeneralFailures.

## Syntax (C#)
```csharp
public static class GeneralFailures
```